offsets = {
    ["12.3.0"] = {
        ["猫缶"] = -0x118,
        ["XP"] = 0x40,
        ["NP"] = 0x48,
        ["ニャンチケ"] = 0x2DF524,
        ["レアチケ"] = 0x2DF52C,
        ["プラチケ"] = -0x8E50,
        ["レジェチケ"] = -0x8E48,
        ["プラチケの欠片"] = -0x8E40,
    },
    ["12.4.0"] = {
        ["猫缶"] = -0x120,  -- バージョンごとにオフセットが変わる
        ["XP"] = 0x50,
        ["NP"] = 0x58,
        ["ニャンチケ"] = 0x2DF530,
        ["レアチケ"] = 0x2DF538,
        ["プラチケ"] = -0x8E60,
        ["レジェチケ"] = -0x8E58,
        ["プラチケの欠片"] = -0x8E50,
    },
}
